[
  {
    "name": "Adult Male Labrador Retriever (Adoption)",
    "category": "Pets (Adoption)",
    "price": 26999,
    "location": "Dhaka, Bangladesh",
    "description": "This magnificent 2-year-old male Labrador Retriever is currently seeking a forever home. He is **neutered, fully vaccinated**, and possesses an incredibly **high energy level**, making him an ideal companion for an active individual or a family with a large yard. While he is an **excellent family dog** known for his loyalty and affectionate nature, he will require **consistent training and mental stimulation** to channel his enthusiasm positively. Labradors thrive on routine and human interaction, so we are looking for adopters who can dedicate ample time to exercise, play, and ongoing obedience work. His adoption fee covers initial medical checks and essential supplies. If you're ready for an energetic, loving, and loyal friend, please inquire.",
    "image": "https://spotpet.com/_next/image?url=https%3A%2F%2Fimages.ctfassets.net%2Fm5ehn3s5t7ec%2Fwp-image-201149%2Fd50b626a24e3b46d8fd778e55d660a17%2FLabrador_Ratriever_Price.webp&w=3840&q=75",
    "email": "adoption@example.com",
    "date": "2025-11-05"
  },
  {
    "name": "Premium High-Protein Beef Kibble (15kg)",
    "category": "Pet Food",
    "price": 1800,
    "location": "Rajshahi, Bangladesh",
    "description": "The **15 kg bag** of our Premium High-Protein Beef Kibble is specially formulated to meet the demanding **nutritional needs of highly active or working dogs**. This performance blend features **real beef as the primary ingredient**, ensuring maximum bioavailability and muscle support. It is fortified with essential **vitamins, minerals, and Omega fatty acids** for coat health. The dense nutritional content means dogs get all the energy they need without excessive fillers. This kibble is designed to support **sustained endurance, rapid recovery**, and maintain peak physical condition. Recommended by veterinarians for dogs involved in sports, agility, or requiring high caloric intake. Ensure your dog receives adequate hydration with this diet.",
    "image": "https://4pawsraw.co.uk/wp-content/uploads/2020/01/ugfwd_beef.webp",
    "email": "sales@petfoodpro.com",
    "date": "2025-11-09"
  },
  {
    "name": "Medium Cat Scratching Tree & Condo",
    "category": "Accessories",
    "price": 4500,
    "location": "Chattogram, Bangladesh",
    "description": "Elevate your cat's environment with this **multi-level Cat Scratching Tree and Condo**. Standing at a medium height, it features several platforms for climbing, lounging, and surveying their territory. The central posts are wrapped in **durable natural sisal rope**, providing a dedicated and appropriate outlet for scratching, which helps maintain claw health and protects your furniture. The **plush, cozy condo** at the base offers a private retreat for naps and security. Suitable for multiple cats or kittens, this tree encourages exercise and helps alleviate boredom, promoting both physical and mental well-being for your feline friend. Easy assembly required.",
    "image": "https://assets.wfcdn.com/im/35801533/compr-r85/2838/283830061/Cat+Tree%2C+36.5+Inches+Cat+Tower+For+Indoor+Cats%2C+Multi-Level+Cactus+Cat+Tree+With+Scratching+Posts%2C+Private+Cat+Condo%2C+Plush+Perch+For+Small+Cat+Kittens.jpg",
    "email": "sales@catworld.com",
    "date": "2025-11-04"
  },
  {
    "name": "Senior Dog Glucosamine Chews (Mobility)",
    "category": "Pet Care Products",
    "price": 950,
    "location": "Khulna, Bangladesh",
    "description": "These delicious, **soft-chew supplements** are specifically designed to support the **joint health and mobility of senior dogs** or large breeds prone to joint issues. Each chew is packed with veterinary-grade **Glucosamine and Chondroitin**, which help lubricate joints and maintain cartilage resilience. Regular use can significantly **reduce stiffness, increase comfort**, and improve the overall quality of life for your aging companion. The chews are naturally flavored, making them easy to administer without fuss, and are free from common allergens. Incorporate this supplement into your dog's daily routine to help them stay active and enjoy their golden years comfortably. Consult your vet before starting any new supplement.",
    "image": "https://restyourpaws.com.au/wp-content/uploads/2025/07/GLYDE.jpg",
    "email": "health@petmeds.com",
    "date": "2025-10-28"
  },
  {
    "name": "Female Scottish Fold Kitten (Adoption)",
    "category": "Pets (Adoption)",
    "price": 14000,
    "location": "Sylhet, Bangladesh",
    "description": "Meet this charming **6-month-old female Scottish Fold kitten** ready for her new home. Known for their characteristic **folded ears and sweet, calm temperament**, she is an incredibly affectionate and quiet companion. This kitten is **fully litter trained, vaccinated, and recently vet-checked**. Her gentle nature makes her **ideal for apartment living** or a home seeking a less demanding pet. She enjoys cuddles and quiet play, though she still maintains the playful curiosity of a kitten. Prospective adopters should be aware of the specific care needs associated with the Scottish Fold breed. References and a home visit may be required to ensure the best possible match.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT3eqmyTvramhWO4fYjQEcfNni_-deqjZBJhOwov-JDgszroTWtmVtJzHccS9Ov1gX-w-c&usqp=CAU",
    "email": "shelter@example.com",
    "date": "2025-10-25"
  },
  {
    "name": "Salmon Oil Supplement (Omega-3, 500ml)",
    "category": "Pet Care Products",
    "price": 820,
    "location": "Barishal, Bangladesh",
    "description": "Our premium **500ml liquid Salmon Oil Supplement** is a potent source of **Omega-3 essential fatty acids (EPA and DHA)** derived from wild-caught salmon. This supplement is vital for promoting **healthy skin, reducing itchiness and dryness, and achieving a shiny, lustrous coat** in both dogs and cats. Beyond external benefits, Omega-3s are crucial for **supporting joint function, cardiovascular health, and cognitive development**. The easy-to-dispense liquid can be mixed directly into your pet’s food daily. Regular intake helps strengthen the immune system and reduces inflammation. A simple addition for comprehensive wellness.",
    "image": "https://m.media-amazon.com/images/I/81+2SMBcM6L._AC_UF1000,1000_QL80_.jpg",
    "email": "vetcare@pethealth.com",
    "date": "2025-11-01"
  },
  {
    "name": "L-Shape Pet Sofa Bed (Washable)",
    "category": "Accessories",
    "price": 2500,
    "location": "Dhaka, Bangladesh",
    "description": "Provide ultimate comfort for your medium-sized dog with this stylish **L-Shape Pet Sofa Bed**. Designed with **orthopedic support** in mind, the raised bolster edges offer a comfortable headrest and security, mimicking a protective embrace. The soft, high-density foam base ensures pressure relief for older or arthritic pets. A key feature is the **removable, machine-washable cover**, which makes cleaning effortless and keeps the bed fresh and hygienic. The modern L-shape fits neatly into room corners, maximizing space while providing a luxurious resting spot your pet will adore. Durable, comfortable, and practical for daily use.",
    "image": "https://m.media-amazon.com/images/I/71U0xfQkOdL._AC_SL1500_.jpg",
    "email": "tech@petdevice.com",
    "date": "2025-11-07"
  },
  {
    "name": "Tuna & Rice Wet Cat Food (6-Pack Cans)",
    "category": "Pet Food",
    "price": 620,
    "location": "Chattogram, Bangladesh",
    "description": "Treat your feline to a gourmet experience with this **6-Pack of Tuna & Rice Wet Cat Food**. Each can contains a delectable recipe featuring **real flaked tuna** as the first ingredient, providing a high-quality source of protein that cats naturally crave. The addition of rice ensures easy digestion. Wet food is an excellent way to **increase your cat's hydration**, which is vital for urinary tract health. This formula is **complete and balanced** for adult maintenance and contains no artificial colors, flavors, or preservatives. Serve as a complete meal or as a tasty topper to dry kibble to encourage fussy eaters.",
    "image": "https://www.instacart.com/image-server/1864x1864/www.instacart.com/assets/domains/product-image/file/large_5bc8d865-24b6-4514-8507-993201a84a04.jpg",
    "email": "info@premiumfood.com",
    "date": "2025-10-30"
  },
  {
    "name": "Male Rottweiler Puppy (Adoption)",
    "category": "Pets (Adoption)",
    "price": 21000,
    "location": "Khulna, Bangladesh",
    "description": "This promising **4-month-old male Rottweiler puppy** is looking for a committed and loving home. He is an intelligent, bold, and confident young dog who has already begun **basic obedience training**. Rottweilers require **experienced ownership** due to their size, strength, and protective instincts. They excel with consistent boundaries, early socialization, and positive reinforcement. He has been **dewormed, has his first set of vaccinations**, and comes with a health guarantee. We are seeking an individual or family dedicated to providing the necessary structure and physical exercise to ensure he grows into a well-behaved and stable adult.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRwxP0xFXStLv7GO_Mc14WeUdefarKbY4u6o11QVZu5YiTXZSDBnAZyYD6PE1pmUBNOX7c&usqp=CAU",
    "email": "rescue@example.com",
    "date": "2025-11-03"
  },
  {
    "name": "Natural Bird Cage Cleaner Spray (500ml)",
    "category": "Pet Care Products",
    "price": 350,
    "location": "Rajshahi, Bangladesh",
    "description": "Maintain a pristine and hygienic habitat for your feathered friends with our **500ml Natural Bird Cage Cleaner Spray**. This formula is **non-toxic, bio-degradable, and completely safe** for birds, small animals, and their environments. It effectively breaks down droppings, caked-on messes, and general grime without leaving harsh chemical residues or strong fumes that could irritate their respiratory system. Ideal for **daily cleaning** of cages, perches, and toys. Simply spray, wipe, and watch the cage sparkle, promoting a healthier environment and reducing the risk of bacterial build-up.",
    "image": "https://a.storyblok.com/f/152022/59830cd1c0/johnsons-cage-bird-clean-safe-side.jpg",
    "email": "clean@petfresh.com",
    "date": "2025-11-08"
  },
  {
    "name": "Extra Absorbent Puppy Training Pads (100 Count)",
    "category": "Accessories",
    "price": 1500,
    "location": "Sylhet, Bangladesh",
    "description": "Accelerate your puppy's house training process with this bulk pack of **100 Extra Absorbent Training Pads**. Each pad features a **five-layer protective design** with a rapid-drying surface to minimize tracking and instantly lock in moisture. The core contains a powerful polymer that converts liquid into gel, offering superior absorption capacity. Furthermore, these pads are treated with a **built-in attractant scent** that naturally encourages your puppy to use the pad, making the transition to outdoor potty breaks smoother. Perfect for young puppies, senior dogs, or crate lining.",
    "image": "https://m.media-amazon.com/images/I/61CbkI6TkKS._AC_UF1000,1000_QL80_.jpg",
    "email": "outdoor@petgear.com",
    "date": "2025-11-02"
  },
  {
    "name": "Reptile Calcium & D3 Dust (100g)",
    "category": "Pet Food",
    "price": 400,
    "location": "Barishal, Bangladesh",
    "description": "Ensure your reptile's longevity and bone strength with our **100g Reptile Calcium & D3 Dust**. A common issue in captive reptiles is Metabolic Bone Disease (MBD), which is often caused by calcium deficiency. This powder provides a high-quality source of **calcium carbonate blended with Vitamin D3**, which is essential for calcium absorption, especially in reptiles that rely on UVB lighting. The ultra-fine powder is easy to **dust onto feeder insects or vegetables** just before feeding. Consistent use is crucial for optimal health, preventing skeletal deformities, and supporting breeding. Suitable for lizards, turtles, and other reptiles with high D3 needs.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTpDQkCELMnF3ZWcOygcTVRE86vbkfNYPOhyAWLCona8SkPzt8oQZ_4lTwpEG8DdzpF6lQ&usqp=CAU",
    "email": "nutrition@exotics.com",
    "date": "2025-10-27"
  },
  {
    "name": "Male Syrian Hamster & Full Setup (Adoption)",
    "category": "Pets (Adoption)",
    "price": 12000,
    "location": "Mymensingh, Bangladesh",
    "description": "A wonderful opportunity to adopt a friendly **male long-haired Syrian Hamster** along with his **complete habitat setup**. This young hamster is nocturnal, inquisitive, and enjoys gentle handling. The adoption includes a **large, multi-level cage** that meets Syrian hamster size requirements, a quiet running wheel, water bottle, food dish, and initial bedding/food supplies. This package is ideal for a first-time small pet owner, ensuring the animal has everything needed for a happy, enriching life from day one. Hamsters are relatively low-maintenance but require daily interaction and cage spot cleaning. Available for immediate pick-up.",
    "image": "https://cdn.omlet.com/images/originals/syrians-are-friendly.jpg",
    "email": "smallpets@example.com",
    "date": "2025-11-06"
  },
  {
    "name": "Heavy Duty Double-Door Dog Crate (Large)",
    "category": "Accessories",
    "price": 5800,
    "location": "Rangpur, Bangladesh",
    "description": "Invest in a secure and durable space for your large canine with this **Heavy Duty Double-Door Dog Crate**. Constructed from **robust, thick-gauge metal wire**, this crate is built to last and provides a safe haven for your pet during training or travel. The **double-door design** (front and side access) offers flexibility in placement within your home. It features **secure slide-bolt latches** and a **slide-out plastic tray** for effortless cleaning of accidents. The crate is also **fully foldable** for convenient storage and portability. A vital tool for house training and creating a comforting den environment.",
    "image": "https://images-na.ssl-images-amazon.com/images/I/51SfebHfKsL._SL500_._AC_SL500_.jpg",
    "email": "tools@petessentials.com",
    "date": "2025-11-10"
  },
  {
    "name": "Pair of Female Fancy Mice (Adoption)",
    "category": "Pets (Adoption)",
    "price": 4000,
    "location": "Cox's Bazar, Bangladesh",
    "description": "Available for adoption is this delightful **pair of female Fancy Mice**. Mice are social animals, and these two must be kept together. They are **very friendly, highly inquisitive, and endlessly entertaining** to watch. Their small size and quiet nature make them an **excellent first pet** for responsible older children or adults. They require a secure cage with ample enrichment, including tunnels, wheels, and climbing opportunities. They are fully vet-checked and come with a small starting supply of food and bedding. Adopting a pair ensures they remain happy and well-adjusted. Please inquire about their dietary and housing needs.",
    "image": "https://woodgreen.org.uk/wp-content/uploads/2021/11/three_mice_held_in_a_hand.jpeg",
    "email": "foster@example.com",
    "date": "2025-10-29"
  },
  {
    "name": "Anti-Itch Hypoallergenic Dog Shampoo (500ml)",
    "category": "Pet Care Products",
    "price": 550,
    "location": "Jessore, Bangladesh",
    "description": "Soothe your dog's sensitive skin with our **500ml Anti-Itch Hypoallergenic Shampoo**. This gentle, **soap-free, and paraben-free formula** is specifically designed for pets suffering from **severe skin allergies, dry skin, or persistent itchiness**. It utilizes natural ingredients like **oatmeal and aloe vera** to provide deep moisturizing and immediate relief from irritation without stripping the coat's natural oils. The **non-irritating, tearless formula** ensures a comfortable bathing experience, leaving the coat clean, soft, and smelling fresh. Recommended by dermatologists for routine use on highly sensitive pets.",
    "image": "https://m.media-amazon.com/images/I/71MAww4L7ZL._AC_SX569_.jpg",
    "email": "grooming@petsparkle.com",
    "date": "2025-11-07"
  },
  {
    "name": "Interactive Feather Wand Cat Toy",
    "category": "Accessories",
    "price": 180,
    "location": "Comilla, Bangladesh",
    "description": "Spark your cat's predatory instincts with this highly **Interactive Feather Wand Toy**. Featuring a **long, flexible, and durable wand**, it allows you to mimic the erratic movements of prey, providing essential physical exercise and mental stimulation for your indoor cat. The natural feather attachments are irresistible and encourage leaping, chasing, and pouncing. Regular interactive play with a wand is crucial for bonding with your cat and helps **reduce boredom and destructive behavior**. A simple yet effective tool for enriching your cat's daily life and ensuring they stay fit and happy.",
    "image": "https://images-cdn.ubuy.qa/63b0c6dbcfa2f401d30fa1e3-wen-4pcs-cats-toy-wand.jpg",
    "email": "toys@playfulpets.com",
    "date": "2025-10-31"
  },
  {
    "name": "Dry Cat Food for Sensitive Skin (2.5kg)",
    "category": "Pet Food",
    "price": 980,
    "location": "Bogra, Bangladesh",
    "description": "This **2.5 kg bag of Dry Cat Food** is tailored for felines with **food sensitivities or digestive issues**. The **limited-ingredient recipe** focuses on easily digestible proteins like **turkey and potato**, eliminating common irritants such as wheat, corn, and soy. The formula is enriched with **prebiotics and probiotics** to promote a healthy gut flora and improve nutrient absorption. Feeding this specialized diet can help **reduce symptoms like vomiting, diarrhea, or itchy skin** associated with dietary sensitivities. Provide your sensitive cat with the high-quality nutrition they need to thrive, without the discomfort.",
    "image": "https://cdn2.arogga.com/eyJidWNrZXQiOiJhcm9nZ2EiLCJrZXkiOiJQcm9kdWN0LXBfaW1hZ2VzXC84MTM4M1wvODEzODMtT3B0aS1MaWZlLUtpdHRlbi0yLXQwcmZxeS5qcGVnIiwiZWRpdHMiOltdfQ==",
    "email": "felinefriend@care.com",
    "date": "2025-11-06"
  },
  {
    "name": "Trained Male Golden Retriever (Adoption)",
    "category": "Pets (Adoption)",
    "price": 29999,
    "location": "Narayanganj, Bangladesh",
    "description": "This exceptional **4-year-old male Golden Retriever** is available for adoption. He is **house-trained, leash-trained, and has been specifically trained for therapy work**, making him remarkably gentle, calm, and affectionate. He excels in social settings and has a natural, loving disposition towards people of all ages, including children. Ideal for a family seeking an immediate, well-behaved companion or an individual looking for an emotional support animal. He is up-to-date on all his shots and medical records are available. His high price reflects his advanced training and impeccable temperament. Serious inquiries only, please.",
    "image": "https://consumer-cms.petfinder.com/sites/default/files/images/content/Golden%20Retriever%202.jpg",
    "email": "goldencare@example.com",
    "date": "2025-11-01"
  },
  {
    "name": "Dental Cleaning Finger Wipes (50 Count)",
    "category": "Pet Care Products",
    "price": 400,
    "location": "Gazipur, Bangladesh",
    "description": "Simplify your pet's oral hygiene routine with this **pack of 50 disposable Dental Cleaning Finger Wipes**. Designed for **daily use**, these pre-moistened wipes allow you to gently and effectively remove plaque, tartar, and bacteria build-up from your pet's teeth and gums. Regular use helps to **combat bad breath and reduce the risk of periodontal disease**. The textured material and comfortable fit on your finger make reaching all areas of the mouth easy, even for pets resistant to traditional brushing. A quick, hassle-free alternative to toothpaste and brushes for maintaining a healthy mouth.",
    "image": "https://image.chewy.com/catalog/general/images/moe/06849daa-4836-7bfd-8000-966963eb7415._AC_SX500_SY400_QL75_V1_.jpg",
    "email": "oralcare@pethealth.com",
    "date": "2025-11-09"
  },
  {
    "name": "Low-Calorie Weight Management Dog Food (7kg)",
    "category": "Pet Food",
    "price": 1650,
    "location": "Tangail, Bangladesh",
    "description": "Support your dog's healthy weight journey with this **7 kg bag of Low-Calorie Weight Management Dog Food**. Scientifically formulated to be **high in fiber and protein but low in fat and calories**, this diet helps your canine friend feel full while consuming fewer calories. The unique blend assists in **metabolic stimulation and gentle weight loss** while preserving lean muscle mass. This food is often recommended by vets for dogs that are overweight or less active. Transitioning to this diet, combined with exercise, can significantly improve mobility and reduce the risk of weight-related health issues.",
    "image": "https://www.purina.ca/_gatsby/image/9d92e994e1661e1b792c329f3a3182ac/577dc2c3fc359599c8f28a7d23eee2a4/00055800414670_a1n1.png?u=https%3A%2F%2Flive-purina-canada-h20.pantheonsite.io%2Fsites%2Fdefault%2Ffiles%2Fproducts%2F2024-08%2F00055800414670_a1n1.png&a=w%3D250%26h%3D250%26fm%3Dpng%26q%3D75&cd=1191f2fc0cb2b6986f7bdeab2d8448d3",
    "email": "nutrition@vetfood.com",
    "date": "2025-11-03"
  },
  {
    "name": "Aquarium Gravel Vacuum & Siphon Cleaner",
    "category": "Accessories",
    "price": 720,
    "location": "Pabna, Bangladesh",
    "description": "Make aquarium maintenance easier and less messy with this **Gravel Vacuum and Siphon Cleaner**. This essential tool performs two functions: it effectively **removes debris and detritus from the bottom gravel** without disturbing the substrate, and it acts as a reliable **siphon for partial water changes**. The long, clear tube allows for easy visualization of the cleaning process, and the manual pump initiates the siphon quickly. Regular use is key to **maintaining water quality and clarity**, which is crucial for the health of your fish and aquatic plants. Suitable for small to medium-sized tanks.",
    "image": "https://i5.walmartimages.com/seo/Fish-Tank-Aquarium-Gravel-Cleaner-Syphon-Vacuum-Water-Changer-Pump-Siphon-Hose_262a7c9e-1340-4b17-a869-b64e92ae6bc9.20e0c8c31d4af9a8cfab7f6a17f92ca4.jpeg",
    "email": "aquatic@petgear.com",
    "date": "2025-10-26"
  },
  {
    "name": "High-Energy Parrot Pellets (900g)",
    "category": "Pet Food",
    "price": 500,
    "location": "Dinajpur, Bangladesh",
    "description": "Offer your active medium-sized birds (such as **Cockatiels and Conures**) a complete and balanced diet with this **900g bag of High-Energy Parrot Pellets**. Pellets ensure that your bird receives consistent nutrition in every bite, unlike seed mixes where they might only pick out their favorites. This formula is **rich in essential vitamins, minerals, and amino acids** to support brilliant feathering, strong immune function, and sustained energy. The pellets are sized perfectly for easy consumption and are free from artificial colors and preservatives, promoting overall avian health and vitality.",
    "image": "https://m.media-amazon.com/images/I/7141Bn6KyUL._AC_SL1500_.jpg",
    "email": "birds@birdheaven.com",
    "date": "2025-11-05"
  },
  {
    "name": "Anti-Bacterial Ear Cleansing Solution (250ml)",
    "category": "Pet Care Products",
    "price": 490,
    "location": "Saidpur, Bangladesh",
    "description": "Protect your pet from painful ear infections with this **250ml Anti-Bacterial Ear Cleansing Solution**. The **alcohol-free formula** is gentle enough for regular use but powerful enough to effectively **clean, deodorize, and dry the ear canal**, creating an environment less prone to yeast and bacteria growth. It helps to dissolve wax and remove debris, reducing odor and discomfort associated with dirty ears. Especially beneficial for dogs with floppy ears, this solution is a vital part of preventative pet care. Simply apply, massage the base of the ear, and let your pet shake out the excess.",
    "image": "https://fortehealthcare.com/wp-content/uploads/2024/04/Aurleze-250ml-1.jpg",
    "email": "support@careproducts.com",
    "date": "2025-10-24"
  }
]